In [2]:
import pandas as pd 
import numpy as np
import seaborn as sns
import matplotlib.pyplot as pyplot

In [3]:
df = pd.read_csv(r"C:\Users\azhar\Desktop\ML_Projects\notebook\exams.csv")

In [4]:
df.head(5)

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,male,group A,high school,standard,completed,67,67,63
1,female,group D,some high school,free/reduced,none,40,59,55
2,male,group E,some college,free/reduced,none,59,60,50
3,male,group B,high school,standard,none,77,78,68
4,male,group E,associate's degree,standard,completed,78,73,68

In [5]:
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

        math score  reading score  writing score
count  1000.000000    1000.000000    1000.000000
mean     66.396000      69.002000      67.738000
std      15.402871      14.737272      15.600985
min      13.000000      27.000000      23.000000
25%      56.000000      60.000000      58.000000
50%      66.500000      70.000000      68.000000
75%      77.000000      79.000000      79.000000
max     100.000000     100.000000     100.000000

In [6]:
df.nunique()

gender                          2
race/ethnicity                  5
parental level of education     6
lunch                           2
test preparation course         2
math score                     77
reading score                  73
writing score                  76
dtype: int64

In [9]:
num_col = [col for col in df.columns if df[col].dtype !='object']
cat_col = [col for col in df.columns if df[col].dtype =='object']

In [14]:
print(num_col)
print(cat_col)

['math score', 'reading score', 'writing score']
['gender', 'race/ethnicity', 'parental level of education', 'lunch', 'test preparation course']

In [15]:
df['Total_scor'] = df['math score'] + df['reading score'] + df['writing score']/3

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score,Total_scor
0,male,group A,high school,standard,completed,67,67,63,155.000000
1,female,group D,some high school,free/reduced,none,40,59,55,117.333333
2,male,group E,some college,free/reduced,none,59,60,50,135.666667
3,male,group B,high school,standard,none,77,78,68,177.666667
4,male,group E,associate's degree,standard,completed,78,73,68,173.666667